//COLINAMB JOB 1,MSGCLASS=H
//EXAMPLE1 EXEC PGM=AMBLIST REGION=0M
//SYSPRINT DD SYSOUT=*
//LOADLIB1 DD DSN=COLIN.C.REXX.LOAD,DISP=SHR
//SYSIN DD *
  LISTLOAD DDN=LOADLIB1,MEMBER=(COLIN)
/*
