//COLINC3    JOB 1,MSGCLASS=H,COND=(4,LE)                               JOB04692
//S1          JCLLIB ORDER=CBC.SCCNPRC
//* JCL to compile Rexx to C glue assembler file
//* and a program to show how to use Rexx facilies from C.
//*
//* This job uses source file COLIN.C.REXX
//*      COLIN.C.REXXt decks in COLIN.C.REXX.OBJ
//*      and stores the load module in COLIN.C.REXX.LOAD
//*
// SET LOADLIB=COLIN.C.REXX.LOAD
// SET LIBPRFX=CEE
//COMPILE  EXEC PROC=EDCCB,
//       LIBPRFX=&LIBPRFX,
//       CPARM='OPTFILE(DD:SYSOPTF),LSEARCH(/usr/include/),RENT',
// BPARM='SIZE=(900K,124K),RENT,LIST,XREF,RMODE=ANY,AMODE=31'
//COMPILE.SYSOPTF DD DISP=SHR,DSN=COLIN.C.REXX(CPARMS)
//COMPILE.SYSIN    DD  DISP=SHR,DSN=COLIN.C.REXX(QUERY)
//COMPILE.SYSLIB   DD
//                 DD
//                 DD  DISP=SHR,DSN=COLIN.C.REXX
//BIND.SYSLMOD DD DISP=SHR,DSN=&LOADLIB.
//BIND.SYSLIB  DD DISP=SHR,DSN=CEE.SCEESPC
//             DD DISP=SHR,DSN=CEE.SCEELKED
//             DD DISP=SHR,DSN=SYS1.CSSLIB
//* ND.SYSLIB  DD DISP=SHR,DSN=&LIBPRFX..SCEEBIND
//BIND.OBJLIB  DD DISP=SHR,DSN=COLIN.C.REXX.OBJ
//BIND.SYSIN DD *
    INCLUDE OBJLIB(GLUE)
    ENTRY  GLUE
    NAME CPQUERY(R)
/*
//TOBATCH EXEC PGM=IKJEFT01,DYNAMNBR=30,REGION=4096K
//STEPLIB  DD DSN=&LOADLIB,DISP=SHR
//SYSEXEC DD DISP=SHR,DSN=COLIN.C.REXX
//SYSTSPRT DD SYSOUT=A
//SYSPRINT DD SYSOUT=A
//SYSTSIN DD *
%QREXX
/*
//
