//COLINWT  JOB 1,MSGCLASS=H
//LOGP   EXEC PGM=ASMA90,PARM='DECK,NOOBJECT,LIST,XREF(SHORT),NORENT',
//             REGION=0M
//SYSLIB   DD DISP=SHR,DSN=CEE.SCEEMAC
//         DD DSN=SYS1.MACLIB,DISP=SHR
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSPUNCH DD DISP=SHR,DSN=COLIN.C.REXX.OBJ(WTO)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DISP=SHR,DSN=COLIN.C.REXX(WTO)
//*
